nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
/*
 * Copyright (c) 2020 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <stdio.h>

#include <zephyr/shell/shell.h>
#include <zephyr/shell/shell_uart.h>
#include <unistd.h>
#include <getopt.h>

#include <nrf_modem_at.h>

#include "mosh_print.h"
#include "link.h"
#include "link_api.h"
#include "link_shell.h"
#include "link_shell_print.h"
#include "link_shell_pdn.h"
#include "link_settings.h"
#include "net_utils.h"

#define LINK_SHELL_EDRX_VALUE_STR_LENGTH 4
#define LINK_SHELL_EDRX_PTW_STR_LENGTH 4
#define LINK_SHELL_PSM_PARAM_STR_LENGTH 8

enum link_shell_command {
	LINK_CMD_STATUS = 0,
	LINK_CMD_SETTINGS,
	LINK_CMD_CONEVAL,
	LINK_CMD_DEFCONT,
	LINK_CMD_DEFCONTAUTH,
	LINK_CMD_RSRP,
	LINK_CMD_SEARCH,
	LINK_CMD_NCELLMEAS,
	LINK_CMD_MDMSLEEP,
	LINK_CMD_TAU,
	LINK_CMD_CONNECT,
	LINK_CMD_DISCONNECT,
	LINK_CMD_FUNMODE,
	LINK_CMD_SYSMODE,
	LINK_CMD_NORMAL_MODE_AT,
	LINK_CMD_NORMAL_MODE_AUTO,
	LINK_CMD_EDRX,
	LINK_CMD_PSM,
	LINK_CMD_RAI,
	LINK_CMD_DNSADDR
};

enum link_shell_common_options {
	LINK_COMMON_NONE = 0,
	LINK_COMMON_READ,
	LINK_COMMON_WRITE,
	LINK_COMMON_ENABLE,
	LINK_COMMON_DISABLE,
	LINK_COMMON_SUBSCRIBE,
	LINK_COMMON_UNSUBSCRIBE,
	LINK_COMMON_START,
	LINK_COMMON_STOP,
	LINK_COMMON_RESET
};

struct link_shell_cmd_args_t {
	enum link_shell_command command;
	enum link_shell_common_options common_option;
	enum link_sett_modem_reset_type mreset_type;
	enum link_ncellmeas_modes ncellmeasmode;
	enum lte_lc_neighbor_search_type ncellmeas_search_type;
	enum lte_lc_func_mode funmode_option;
	enum lte_lc_system_mode sysmode_option;
	enum lte_lc_system_mode_preference sysmode_lte_pref_option;
	enum lte_lc_lte_mode lte_mode;
};

/******************************************************************************/
static const char link_usage_str[] =
	"Usage: link <subcommand> [options]\n"
	"\n"
	"Subcommands:\n"
	"  status:       Show status of the current connection (no options)\n"
	"  settings:     Option to print or reset all persistent\n"
	"                link subcmd settings.\n"
	"  coneval:      Get connection evaluation parameters (no options)\n"
	"  defcont:      Set custom default PDP context config.\n"
	"                Persistent between the sessions.\n"
	"                Effective when going to normal mode.\n"
	"  defcontauth:  Set custom authentication parameters for\n"
	"                the default PDP context. Persistent between the sessions.\n"
	"                Effective when going to normal mode.\n"
	"  connect:      Connect to given apn by creating and activating a new PDP\n"
	"                context\n"
	"  disconnect:   Disconnect from given apn by deactivating and destroying\n"
	"                a PDP context\n"
	"  rsrp:         Subscribe/unsubscribe for RSRP signal info\n"
	"  ncellmeas:    Start/cancel neighbor cell measurements\n"
	"  search:       Read/write periodic search parameters or start search operation\n"
	"  msleep:       Subscribe/unsubscribe for modem sleep notifications\n"
	"  tau:          Subscribe/unsubscribe for modem TAU pre-warning notifications\n"
	"  funmode:      Set/read functional modes of the modem\n"
	"  sysmode:      Set/read system modes of the modem\n"
	"                Persistent between the sessions. Effective when\n"
	"                going to normal mode.\n"
	"  nmodeat:      Set custom AT commmands that are run when going to normal\n"
	"                mode\n"
	"  nmodeauto:    Enabling/disabling of automatic connecting and going to\n"
	"                normal mode after the bootup. Persistent between the sessions.\n"
	"                Has impact after the bootup\n"
	"  edrx:         Enable/disable eDRX with default or with custom parameters\n"
	"  psm:          Enable/disable Power Saving Mode (PSM) with\n"
	"                default or with custom parameters\n"
	"  rai:          Enable/disable RAI feature. Actual use must be set for commands\n"
	"                supporting RAI. Effective when going to normal mode.\n"
	"  dnsaddr:      Set a manual DNS server address.\n"
	"                The manual DNS server address will be used if the mobile network\n"
	"                operator does not provide any DNS addresses, or if the name\n"
	"                resolution using DNS server(s) provided by mobile network operator\n"
	"                fails for given domain name. The manual DNS address does not\n"
	"                override the mobile network operator provided DNS addresses.\n";

static const char link_settings_usage_str[] =
	"Usage: link settings --read | --reset | --mreset_all | --mreset_user\n"
	"Options:\n"
	"  -r, --read,        Read and print current persistent settings\n"
	"      --reset,       Reset all persistent settings to defaults\n"
	"      --mreset_all,  Reset all modem settings to defaults\n"
	"      --mreset_user, Reset modem user configurable settings to defaults\n";

static const char link_defcont_usage_str[] =
	"Usage: link defcont --enable [options] | --disable | --read\n"
	"Options:\n"
	"  -r, --read,         Read and print current config\n"
	"  -d, --disable,      Disable custom config for default PDP context\n"
	"  -e, --enable,       Enable custom config for default PDP context\n"
	"  -a, --apn, [str]    Set default Access Point Name\n"
	"  -f, --family, [str] Address family: 'ipv4v6' (default), 'ipv4', 'ipv6',\n"
	"                      'non-ip'\n";

static const char link_defcontauth_usage_str[] =
	"Usage: link defcontauth --enable [options] | --disable | --read\n"
	"Options:\n"
	"  -r, --read,         Read and print current config\n"
	"  -d, --disable,      Disable custom config for default PDP context\n"
	"  -e, --enable,       Enable custom config for default PDP context\n"
	"  -U, --uname, [str]  Username\n"
	"  -P, --pword, [str]  Password\n"
	"  -A, --prot, [int]   Authentication protocol (Default: 0 (None), 1 (PAP),\n"
	"                      2 (CHAP)\n";

static const char link_connect_usage_str[] =
	"Usage: link connect --apn <apn str> [--family <pdn family str>] [auth options]\n"
	"Options:\n"
	"  -a, --apn, [str]    Access Point Name\n"
	"  -f, --family, [str] PDN family: 'ipv4v6', 'ipv4', 'ipv6', 'non-ip'\n"
	"Optional authentication options:\n"
	"  -U, --uname, [str]  Username\n"
	"  -P, --pword, [str]  Password\n"
	"  -A, --prot,  [int]  Authentication protocol: 0 (None), 1 (PAP), 2 (CHAP)\n"
	"\n"
	"Usage: link disconnect -I <cid>\n"
	"Options:\n"
	"  -I, --cid, [int]    Use this option to disconnect specific PDN CID\n";

static const char link_sysmode_usage_str[] =
	"Usage: link sysmode [options] | --read | --reset\n"
	"Options:\n"
	"  -r, --read,             Read system modes set in modem and by 'link sysmode'\n"
	"      --reset,            Reset the set sysmode as default\n"
	"  -m, --ltem,             Set LTE-M (LTE Cat-M1) system mode\n"
	"  -n, --nbiot,            Set NB-IoT (LTE Cat-NB1) system mode\n"
	"      --ltem_nbiot,       Set LTE-M + NB-IoT system mode\n"
	"  -g, --gnss,             Set GNSS system mode\n"
	"  -M, --ltem_gnss,        Set LTE-M + GNSS system mode\n"
	"  -N, --nbiot_gnss,       Set NB-IoT + GNSS system mode\n"
	"      --ltem_nbiot_gnss,  Set LTE-M + NB-IoT + GNSS system mode\n"
	"\n"
	"Additional LTE mode preference that can be optionally given\n"
	"and might make an impact with multimode system modes in modem,\n"
	" i.e. with --ltem_nbiot or --ltem_nbiot_gnss\n"
	"      --pref_auto,            auto, selected by modem (set as default if not\n"
	"                              given)\n"
	"      --pref_ltem,            LTE-M is preferred over PLMN selection\n"
	"      --pref_nbiot,           NB-IoT is preferred over PLMN selection\n"
	"      --pref_ltem_plmn_prio,  LTE-M is preferred, but PLMN selection is more\n"
	"                              important\n"
	"      --pref_nbiot_plmn_prio, NB-IoT is preferred, but PLMN selection is more\n"
	"                              important\n";

static const char link_funmode_usage_str[] =
	"Usage: link funmode [option] | --read\n"
	"Options:\n"
	"  -r, --read,              Read modem functional mode\n"
	"  -0, --pwroff,            Set modem power off\n"
	"  -1, --normal,            Set modem normal mode\n"
	"      --normal_no_rel14,   Set modem normal mode without setting Release 14 features\n"
	"  -4, --flightmode,        Set modem offline.\n"
	"      --lteoff,            Deactivates LTE without shutting down GNSS services.\n"
	"      --lteon,             Activates LTE without changing GNSS.\n"
	"      --gnssoff,           Deactivates GNSS without shutting down LTE services.\n"
	"      --gnsson,            Activates GNSS without changing LTE.\n"
	"      --uiccoff,           Deactivates UICC.\n"
	"      --uiccon,            Activates UICC.\n"
	"      --flightmode_uiccon, Sets the device to flight mode without shutting down\n"
	"                           UICC.\n";

static const char link_normal_mode_at_usage_str[] =
	"Usage: link nmodeat --read | --mem<1-3>\n"
	"Options:\n"
	"  -r, --read,       Read all set custom normal mode at commands\n"
	"      --mem[1-3],   Set at cmd to given memory slot,\n"
	"                    Example: \"link nmodeat --mem1 \"at%xbandlock=2,\\\"100\\\"\"\"\n"
	"                    To clear the given memslot by given the empty string:\n"
	"                    \"link nmodeat --mem2 \"\"\"\n";

