nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
static const char link_normal_mode_auto_usage_str[] =
	"Usage: link nmodeauto --read | --enable | --enable_no_rel14 | --disable\n"
	"Options:\n"
	"  -r, --read,            Read and print current setting\n"
	"  -e, --enable,          Enable autoconnect (default)\n"
	"      --enable_no_rel14, Enable autoconnect without setting Release 14 features\n"
	"  -d, --disable,         Disable autoconnect\n";

static const char link_edrx_usage_str[] =
	"Usage: link edrx --enable --ltem|--nbiot [options] | --disable\n"
	"Options:\n"
	"  -d, --disable,          Disable eDRX\n"
	"  -e, --enable,           Enable eDRX\n"
	"  -m, --ltem,             Set for LTE-M (LTE Cat-M1) system mode\n"
	"  -n, --nbiot,            Set for NB-IoT (LTE Cat-NB1) system mode\n"
	"  -x, --edrx_value, [str] Sets custom eDRX value to be requested when\n"
	"                          enabling eDRX with -e option.\n"
	"  -w, --ptw, [str]        Sets custom Paging Time Window value to be\n"
	"                          requested when enabling eDRX -e option.\n";

static const char link_psm_usage_str[] =
	"Usage: link psm --enable [options] | --disable | --read\n"
	"Options:\n"
	"  -r, --read,         Read PSM config\n"
	"  -d, --disable,      Disable PSM\n"
	"  -e, --enable,       Enable PSM\n"
	"  -p, --rptau, [str]  Sets custom requested periodic TAU value to be requested\n"
	"                      when enabling PSM -e option.\n"
	"  -t, --rat, [str]    Sets custom requested active time (RAT) value to be\n"
	"                      requested when enabling PSM -e option.\n";

static const char link_rsrp_usage_str[] =
	"Usage: link rsrp --subscribe | --unsubscribe\n"
	"Options:\n"
	"  -s, --subscribe,    Subscribe for RSRP info\n"
	"  -u, --unsubscribe,  Unsubscribe for RSRP info\n";

static const char link_search_usage_str[] =
	"Usage: link search --read | --write | --clear | --start\n"
	"\n"
	"Options:\n"
	"  -r, --read,   Read modem search configuration\n"
	"      --clear,  Clear modem search configuration\n"
	"      --write,  Write modem search configuration.\n"
	"                Use --search_cfg option to define the configuration and\n"
	"                any combination of 1 to 4 --search_pattern_range or\n"
	"                --search_pattern_table options.\n"
	"                Default values will be used if no additional parameters are provided.\n"
	"      --search_cfg, [str]\n"
	"                Search configuration in the following format (3 numbers):\n"
	"                  <loop>,<return_to_pattern>,<band_optimization>\n"
	"      --search_pattern_range, [str]\n"
	"                Range type of search pattern in the following format (4 numbers):\n"
	"                  <initial_sleep>,<final_sleep>,<time_to_final_sleep>,<pattern_end_point>\n"
	"                Set <time_to_final_sleep> to -1 if it is not given.\n"
	"      --search_pattern_table, [str]\n"
	"                Table type of search pattern in the following format (1 to 5 numbers):\n"
	"                  <val1>[,<val2>][,<val3>][,<val4>][,<val5>]\n"
	"      --start,  Start modem search request. This is an extra request outside of\n"
	"                the periodic requests. However, the search is performed only\n"
	"                when the modem is in sleep state between periodic searches.\n"
	"\n"
	"For more details on the individual parameters referred to with <param>, see:\n"
	"https://infocenter.nordicsemi.com/index.jsp?topic=%2Fref_at_commands%2FREF%2Fat_commands%2Fnw_service%2Fperiodicsearchconf_set.html\n";

static const char link_ncellmeas_usage_str[] =
	"Usage: link ncellmeas --single | --continuous [--interval <interval_in_secs>] | --cancel\n"
	"                      [--search_type <type>]\n"
	"Options:\n"
	"   --single,          Start a neighbor cell measurement and report result\n"
	"   --continuous,      Start continuous neighbor cell measurement mode and report result.\n"
	"                      New cell measurement is done everytime when current cell changes.\n"
	"   --cancel,          Cancel/Stop neighbor cell measurement if still ongoing\n"
	"   --search_type,     Used search type:\n"
	"                      'default', 'ext_light' or 'ext_comp.'\n"
	"Options for continuous mode:\n"
	"   --interval, [int]  Interval can be given in seconds. In addition to continuous mode\n"
	"                      functionality, new cell measurement is done in every interval.\n"
	"\n"
	"Search types explained:\n"
	"                      Default: The modem searches the network it is registered to\n"
	"                      based on previous cell history. For modem firmware\n"
	"                      versions < 1.3.1, this is the only valid option.\n"
	"\n"
	"                      Extended light: the modem starts with the same\n"
	"                      search method as the default type. If needed, it continues to\n"
	"                      search by measuring the radio conditions and makes assumptions on\n"
	"                      where networks might be deployed, i.e. a light search.\n"
	"\n"
	"                      Extended complete: the modem follows the same\n"
	"                      procedure as for type_ext_light, but will continue to perform\n"
	"                      a complete search instead of a light search, and the search is\n"
	"                      performed for all supported bands.\n";

static const char link_msleep_usage_str[] =
	"Usage: link msleep --subscribe [options] | --unsubscribe\n"
	"Options:\n"
	"  -u, --unsubscribe,     Unsubscribe for modem sleep notifications\n"
	"  -s, --subscribe,       Subscribe for modem sleep notifications\n"
	"      --threshold, [int] Shortest value of the duration of the scheduled modem\n"
	"                         sleep that triggers a notification. In milliseconds.\n"
	"Related static configs:\n"
	"  warn_time              Time before modem exits sleep that a pre-warning\n"
	"                         is to be received. Default value from\n"
	"                         CONFIG_LTE_LC_MODEM_SLEEP_PRE_WARNING_TIME_MS.\n";

