nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
		/* PSM specifics: */
		case 'p': /* rptau */
			if (strlen(optarg) == LINK_SHELL_PSM_PARAM_STR_LENGTH) {
				strcpy(psm_rptau_bit_str, optarg);
				psm_rptau_set = true;
			} else {
				mosh_error(
					"RPTAU bit string length must be %d.",
					LINK_SHELL_PSM_PARAM_STR_LENGTH);
				return -EINVAL;
			}
			break;
		case 't': /* rat */
			if (strlen(optarg) == LINK_SHELL_PSM_PARAM_STR_LENGTH) {
				strcpy(psm_rat_bit_str, optarg);
				psm_rat_set = true;
			} else {
				mosh_error(
					"RAT bit string length must be %d.",
					LINK_SHELL_PSM_PARAM_STR_LENGTH);
				return -EINVAL;
			}
			break;

		/* Modem system modes: */
		case 'm':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_LTEM;
			link_cmd_args.lte_mode = LTE_LC_LTE_MODE_LTEM;
			break;
		case 'n':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_NBIOT;
			link_cmd_args.lte_mode = LTE_LC_LTE_MODE_NBIOT;
			break;
		case 'g':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_GPS;
			break;
		case 'M':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_LTEM_GPS;
			break;
		case 'N':
			link_cmd_args.sysmode_option = LTE_LC_SYSTEM_MODE_NBIOT_GPS;
			break;

		/* Common options: */
		case 'e':
			link_cmd_args.common_option = LINK_COMMON_ENABLE;
			break;
		case 'd':
			link_cmd_args.common_option = LINK_COMMON_DISABLE;
			break;
		case 'r':
			link_cmd_args.common_option = LINK_COMMON_READ;
			break;
		case 'I': /* PDN CID */
			pdn_cid = atoi(optarg);
			if (pdn_cid <= 0) {
				mosh_error(
					"PDN CID (%d) must be positive integer. "
					"Default PDN context (CID=0) cannot be given.",
					pdn_cid);
				return -EINVAL;
			}
			break;
		case 'a': /* APN */
			apn_len = strlen(optarg);
			if (apn_len > LINK_APN_STR_MAX_LENGTH) {
				mosh_error(
					"APN string length %d exceeded. Maximum is %d.",
					apn_len, LINK_APN_STR_MAX_LENGTH);
				return -EINVAL;
			}
			apn = optarg;
			break;
		case 'f': /* Address family */
			family = optarg;
			break;
		case 'i': /* IP address */
			ip_address = optarg;
			break;
		case 'A': /* auth protocol */
			protocol = atoi(optarg);
			protocol_given = true;
			break;
		case 'U': /* auth username */
			username = optarg;
			break;
		case 'P': /* auth password */
			password = optarg;
			break;
		/* Options without short option: */
		case LINK_SHELL_OPT_SINGLE:
			link_cmd_args.ncellmeasmode = LINK_NCELLMEAS_MODE_SINGLE;
			break;
		case LINK_SHELL_OPT_CONTINUOUS:
			link_cmd_args.ncellmeasmode = LINK_NCELLMEAS_MODE_CONTINUOUS;
			break;
		case LINK_SHELL_OPT_NCELLMEAS_SEARCH_TYPE:
			link_cmd_args.ncellmeas_search_type =
				link_shell_string_to_ncellmeas_search_type(optarg);
			if (link_cmd_args.ncellmeas_search_type ==
			    MOSH_NCELLMEAS_SEARCH_TYPE_NONE) {
				mosh_error("Unknown search_type. See usage:");
				goto show_usage;
			}
			break;
		case LINK_SHELL_OPT_SEARCH_CFG: {
			int loop_integer = 0;

			ret = sscanf(
				optarg,
				"%d,%hd,%hd",
				&loop_integer,
				&search_cfg.return_to_pattern,
				&search_cfg.band_optimization);

			if (ret < 0) {
				mosh_error("Reading --search_cfg option failed: %d", ret);
				return -EINVAL;
			} else if (ret != 3) {
				mosh_error(
					"3 values should be given for --search_cfg option "
					"but %d given", ret);
				return -EINVAL;
			}

			if (loop_integer != 0 && loop_integer != 1) {
				mosh_error(
					"1st parameter of --search_cfg option must be 0 or 1 "
					"but %d given", loop_integer);
				return -EINVAL;
			}

			search_cfg.loop = loop_integer;
			search_cfg_given = true;
			break;
		}
		case LINK_SHELL_OPT_SEARCH_PATTERN_RANGE: {
			int index = search_cfg.pattern_count;

			ret = sscanf(
				optarg,
				"%hd,%hd,%hd,%hd",
				&search_cfg.patterns[index].range.initial_sleep,
				&search_cfg.patterns[index].range.final_sleep,
				&search_cfg.patterns[index].range.time_to_final_sleep,
				&search_cfg.patterns[index].range.pattern_end_point);

			if (ret < 0) {
				mosh_error("Reading --search_pattern_range option failed: %d", ret);
				return -EINVAL;
			} else if (ret != 4) {
				mosh_error(
					"4 values should be given for --search_pattern_range "
					"option but %d given", ret);
				return -EINVAL;
			}
			search_cfg.patterns[index].type = LTE_LC_PERIODIC_SEARCH_PATTERN_RANGE;
			search_cfg.pattern_count++;
			break;
		}
		case LINK_SHELL_OPT_SEARCH_PATTERN_TABLE: {
			int index = search_cfg.pattern_count;

			search_cfg.patterns[index].table.val_2 = -1;
			search_cfg.patterns[index].table.val_3 = -1;
			search_cfg.patterns[index].table.val_4 = -1;
			search_cfg.patterns[index].table.val_5 = -1;

			ret = sscanf(
				optarg,
				"%d,%d,%d,%d,%d",
				&search_cfg.patterns[index].table.val_1,
				&search_cfg.patterns[index].table.val_2,
				&search_cfg.patterns[index].table.val_3,
				&search_cfg.patterns[index].table.val_4,
				&search_cfg.patterns[index].table.val_5);

			if (ret < 0) {
				mosh_error("Reading --search_pattern_table option failed: %d", ret);
				return -EINVAL;
			} else if (ret > 5) {
				mosh_error(
					"1 to 5 values should be given for --search_pattern_table "
					"option but %d given", ret);
				return -EINVAL;
			}
			search_cfg.patterns[index].type = LTE_LC_PERIODIC_SEARCH_PATTERN_TABLE;
			search_cfg.pattern_count++;
			break;
		}
		case LINK_SHELL_OPT_RESET:
			link_cmd_args.common_option = LINK_COMMON_RESET;
			break;
		case LINK_SHELL_OPT_WRITE:
			link_cmd_args.common_option = LINK_COMMON_WRITE;
			break;
		case LINK_SHELL_OPT_MRESET_ALL:
			link_cmd_args.mreset_type = LINK_SHELL_MODEM_FACTORY_RESET_ALL;
			break;
		case LINK_SHELL_OPT_MRESET_USER:
			link_cmd_args.mreset_type = LINK_SHELL_MODEM_FACTORY_RESET_USER_CONFIG;
			break;
		case LINK_SHELL_OPT_START:
			link_cmd_args.common_option = LINK_COMMON_START;
			break;
		case LINK_SHELL_OPT_STOP:
			link_cmd_args.common_option = LINK_COMMON_STOP;
			break;

		case LINK_SHELL_OPT_MEM_SLOT_1:
			normal_mode_at_str = optarg;
			normal_mode_at_mem_slot = 1;
			break;
		case LINK_SHELL_OPT_MEM_SLOT_2:
			normal_mode_at_str = optarg;
			normal_mode_at_mem_slot = 2;
			break;
		case LINK_SHELL_OPT_MEM_SLOT_3:
			normal_mode_at_str = optarg;
			normal_mode_at_mem_slot = 3;
			break;

		case LINK_SHELL_OPT_SYSMODE_LTEM_NBIOT:
			link_cmd_args.sysmode_option =
				LTE_LC_SYSTEM_MODE_LTEM_NBIOT;
			break;
		case LINK_SHELL_OPT_SYSMODE_LTEM_NBIOT_GNSS:
			link_cmd_args.sysmode_option =
				LTE_LC_SYSTEM_MODE_LTEM_NBIOT_GPS;
			break;

		case LINK_SHELL_OPT_SYSMODE_PREF_AUTO:
			link_cmd_args.sysmode_lte_pref_option =
				LTE_LC_SYSTEM_MODE_PREFER_AUTO;
			break;
		case LINK_SHELL_OPT_SYSMODE_PREF_LTEM:
			link_cmd_args.sysmode_lte_pref_option =
				LTE_LC_SYSTEM_MODE_PREFER_LTEM;
			break;
		case LINK_SHELL_OPT_SYSMODE_PREF_NBIOT:
			link_cmd_args.sysmode_lte_pref_option =
				LTE_LC_SYSTEM_MODE_PREFER_NBIOT;
			break;
		case LINK_SHELL_OPT_SYSMODE_PREF_LTEM_PLMN_PRIO:
			link_cmd_args.sysmode_lte_pref_option =
				LTE_LC_SYSTEM_MODE_PREFER_LTEM_PLMN_PRIO;
			break;
		case LINK_SHELL_OPT_SYSMODE_PREF_NBIOT_PLMN_PRIO:
			link_cmd_args.sysmode_lte_pref_option =
				LTE_LC_SYSTEM_MODE_PREFER_NBIOT_PLMN_PRIO;
			break;
		case LINK_SHELL_OPT_THRESHOLD_TIME:
			threshold_time = atoi(optarg);
			if (threshold_time <= 0) {
				mosh_error(
					"Not a valid number for --threshold_time (milliseconds).");
				return -EINVAL;
			}
			break;
		case LINK_SHELL_OPT_NCELLMEAS_CONTINUOUS_INTERVAL_TIME:
			periodic_time = atoi(optarg);
			if (periodic_time <= 0) {
				mosh_error(
					"Not a valid number for --interval (seconds).");
				return -EINVAL;
			}
			break;
		case LINK_SHELL_OPT_NMODE_NO_REL14:
			if (link_cmd_args.command == LINK_CMD_NORMAL_MODE_AUTO) {
				/* Enable autoconnect without REL14 features */
				link_cmd_args.common_option = LINK_COMMON_ENABLE;
			} else if (link_cmd_args.command == LINK_CMD_FUNMODE) {
				/* Go to normal mode without REL14 features */
				link_cmd_args.funmode_option = LTE_LC_FUNC_MODE_NORMAL;
			}
			nmode_use_rel14 = false;
			break;
		case '?':
			goto show_usage;
		default:
			mosh_error("Unknown option. See usage:");
			goto show_usage;
		}
	}

	/* Check that all mandatory args were given */
	if (require_apn && apn == NULL) {
		mosh_error("Option -a | -apn MUST be given. See usage:");
		goto show_usage;
	} else if (require_pdn_cid && pdn_cid == 0) {
		mosh_error("-I / --cid MUST be given. See usage:");
		goto show_usage;
	} else if (require_subscribe &&
		   link_cmd_args.common_option == LINK_COMMON_NONE) {
		mosh_error("Either -s or -u MUST be given. See usage:");
		goto show_usage;
	} else if (require_option &&
		   link_cmd_args.funmode_option == LINK_FUNMODE_NONE &&
		   link_cmd_args.sysmode_option == LTE_LC_SYSTEM_MODE_NONE &&
		   link_cmd_args.ncellmeasmode == LINK_NCELLMEAS_MODE_NONE &&
		   link_cmd_args.common_option == LINK_COMMON_NONE) {
		mosh_error("Command needs option to be given. See usage:");
		goto show_usage;
	}

