nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
			ret = lte_lc_psm_req(true);
			if (ret < 0) {
				mosh_error("Cannot enable PSM: %d", ret);
			} else {
				mosh_print("PSM enabled");
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			ret = lte_lc_psm_req(false);
			if (ret < 0) {
				mosh_error("Cannot disable PSM: %d", ret);
			} else {
				mosh_print("PSM disabled");
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_READ) {
			int tau, active_time;

			ret = lte_lc_psm_get(&tau, &active_time);
			if (ret < 0) {
				mosh_error("Cannot get PSM configs: %d", ret);
			} else {
				mosh_print(
					"PSM config: TAU %d %s, active time %d %s",
					tau,
					(tau == -1) ? "(timer deactivated)" :
					"seconds",
					active_time,
					(active_time == -1) ?
					"(timer deactivated)" :
					"seconds");
			}
		} else {
			mosh_error("Unknown option for psm command. See usage:");
			goto show_usage;
		}
		break;

	case LINK_CMD_RSRP:
		(link_cmd_args.common_option == LINK_COMMON_SUBSCRIBE) ?
		link_rsrp_subscribe(true) :
		link_rsrp_subscribe(false);
		break;
	case LINK_CMD_SEARCH:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {

			ret = lte_lc_periodic_search_get(&search_cfg);
			if (ret) {
				mosh_error("Reading search configuration failed: %d", ret);
			} else {
				mosh_print("Search configuration:");
				mosh_print("  Loop: %s", search_cfg.loop ? "True" : "False");
				mosh_print("  Return to pattern: %u", search_cfg.return_to_pattern);
				mosh_print("  Band optimization: %u", search_cfg.band_optimization);
				mosh_print("  Pattern count: %d", search_cfg.pattern_count);
				for (int i = 0; i < search_cfg.pattern_count; i++) {
					struct lte_lc_periodic_search_pattern *pattern =
						&search_cfg.patterns[i];
					mosh_print("  [%d] Type: %s", i,
						(pattern->type ==
						 LTE_LC_PERIODIC_SEARCH_PATTERN_RANGE) ?
						"Range" : "Table");

					if (pattern->type == LTE_LC_PERIODIC_SEARCH_PATTERN_RANGE) {
						mosh_print("  [%d] Initial sleep: %u", i,
							pattern->range.initial_sleep);
						mosh_print("  [%d] Final sleep: %u", i,
							pattern->range.final_sleep);
						mosh_print("  [%d] Time to final sleep: %d", i,
							pattern->range.time_to_final_sleep);
						mosh_print("  [%d] Pattern endpoint: %d", i,
							pattern->range.pattern_end_point);
					} else if (pattern->type ==
						   LTE_LC_PERIODIC_SEARCH_PATTERN_TABLE) {
						mosh_print("  [%d] Value 1: %d", i,
							pattern->table.val_1);
						mosh_print("  [%d] Value 2: %d", i,
							pattern->table.val_2);
						mosh_print("  [%d] Value 3: %d", i,
							pattern->table.val_3);
						mosh_print("  [%d] Value 4: %d", i,
							pattern->table.val_4);
						mosh_print("  [%d] Value 5: %d", i,
							pattern->table.val_5);
					} else {
						mosh_error("Unknown pattern");
					}
				}
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_WRITE) {

			if (!search_cfg_given) {
				mosh_print(
					"No --search_cfg option given, "
					"using default configuration");

				/* Using search parameters for normal power level mentioned in
				 * https://infocenter.nordicsemi.com/index.jsp?topic=%2Fref_at_commands%2FREF%2Fat_commands%2Fnw_service%2Fperiodicsearchconf_set.html
				 */
				search_cfg.loop = false;
				search_cfg.return_to_pattern = 0;
				search_cfg.band_optimization = 1;
				search_cfg.pattern_count = 2;

				search_cfg.patterns[0].type = LTE_LC_PERIODIC_SEARCH_PATTERN_RANGE;
				search_cfg.patterns[0].range.initial_sleep = 10;
				search_cfg.patterns[0].range.final_sleep = 40;
				search_cfg.patterns[0].range.time_to_final_sleep = 5;
				search_cfg.patterns[0].range.pattern_end_point = 15;

				search_cfg.patterns[1].type = LTE_LC_PERIODIC_SEARCH_PATTERN_TABLE;
				search_cfg.patterns[1].table.val_1 = 60;
				search_cfg.patterns[1].table.val_2 = 90;
				search_cfg.patterns[1].table.val_3 = 300;
				search_cfg.patterns[1].table.val_4 = -1;
				search_cfg.patterns[1].table.val_5 = -1;

			} else if (search_cfg.pattern_count == 0) {
				mosh_error(
					"No --search_pattern_range or --search_pattern_table "
					"options given");
				return -EINVAL;
			}

			ret = lte_lc_periodic_search_set(&search_cfg);
			if (ret) {
				mosh_error("Writing search configuration failed: %d", ret);
			} else {
				mosh_print("Writing search configuration succeeded");
			}

		} else if (link_cmd_args.common_option == LINK_COMMON_START) {
			ret = lte_lc_periodic_search_request();
			if (ret) {
				mosh_error("Starting search failed: %d", ret);
			} else {
				mosh_print("Search requested");
			}
		} else if (link_cmd_args.common_option == LINK_COMMON_RESET) {
			ret = lte_lc_periodic_search_clear();
			if (ret) {
				mosh_error("Clearing search configuration failed: %d", ret);
			} else {
				mosh_print("Search configuration cleared");
			}
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_NCELLMEAS:
		if (link_cmd_args.common_option == LINK_COMMON_STOP) {
			link_ncellmeas_start(false,
					     LINK_NCELLMEAS_MODE_NONE,
					     LTE_LC_NEIGHBOR_SEARCH_TYPE_DEFAULT, 0);

		} else if (link_cmd_args.ncellmeasmode != LINK_NCELLMEAS_MODE_NONE) {
			mosh_print("Neighbor cell measurements and reporting starting");
			link_ncellmeas_start(true,
					     link_cmd_args.ncellmeasmode,
					     link_cmd_args.ncellmeas_search_type,
					     periodic_time);
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_MDMSLEEP:
		if (link_cmd_args.common_option == LINK_COMMON_SUBSCRIBE) {
			link_modem_sleep_notifications_subscribe(
				CONFIG_LTE_LC_MODEM_SLEEP_PRE_WARNING_TIME_MS,
				((threshold_time) ?
					 threshold_time :
					 CONFIG_LTE_LC_MODEM_SLEEP_NOTIFICATIONS_THRESHOLD_MS));
		} else {
			link_modem_sleep_notifications_unsubscribe();
		}
		break;
	case LINK_CMD_TAU:
		if (link_cmd_args.common_option == LINK_COMMON_SUBSCRIBE) {
			link_modem_tau_notifications_subscribe(
				CONFIG_LTE_LC_TAU_PRE_WARNING_TIME_MS,
				((threshold_time) ?
					 threshold_time :
					 CONFIG_LTE_LC_TAU_PRE_WARNING_THRESHOLD_MS));
		} else {
			link_modem_tau_notifications_unsubscribe();
		}
		break;
	case LINK_CMD_CONNECT: {
		struct link_shell_pdn_auth auth_params;
		struct link_shell_pdn_auth *auth_params_ptr = NULL;

