nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/link/link_shell.c
		if ((protocol_given &&
		     (username == NULL || password == NULL)) ||
		    ((username != NULL || password != NULL) &&
		     !protocol_given)) {
			mosh_error("When setting authentication, all auth options must be given");
			goto show_usage;
		} else {
			enum pdn_auth method;

			ret = link_shell_pdn_auth_prot_to_pdn_lib_method_map(
				protocol, &method);
			if (ret) {
				mosh_error("Uknown auth protocol %d", protocol);
				goto show_usage;
			}
			auth_params.method = method;
			auth_params.user = username;
			auth_params.password = password;
			if (protocol_given && username != NULL &&
			    password != NULL) {
				auth_params_ptr = &auth_params;
			}
		}
		ret = link_shell_pdn_connect(apn, family, auth_params_ptr);
	} break;
	case LINK_CMD_RAI:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_rai_read();
		} else if (link_cmd_args.common_option == LINK_COMMON_ENABLE) {
			link_rai_enable(true);
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			link_rai_enable(false);
		} else {
			goto show_usage;
		}
		break;
	case LINK_CMD_DNSADDR:
		if (link_cmd_args.common_option == LINK_COMMON_READ) {
			link_sett_dnsaddr_conf_shell_print();
			break;
		}

		if (ip_address && strlen(ip_address) > 0 &&
		    net_utils_ip_string_is_valid(ip_address) == false) {
			mosh_error("Invalid IP address: %s", ip_address);
			ret = -EINVAL;
			break;
		}

		if (link_cmd_args.common_option == LINK_COMMON_ENABLE) {
			link_sett_save_dnsaddr_enabled(true);
		} else if (link_cmd_args.common_option == LINK_COMMON_DISABLE) {
			link_sett_save_dnsaddr_enabled(false);
		} else if (link_cmd_args.common_option == LINK_COMMON_NONE && ip_address == NULL) {
			goto show_usage;
		}

		ret = link_setdnsaddr(ip_address ? ip_address : link_sett_dnsaddr_ip_get());

		if (ip_address) {
			link_sett_save_dnsaddr_ip(ip_address);
		}
		break;
	case LINK_CMD_DISCONNECT:
		ret = link_shell_pdn_disconnect(pdn_cid);
		break;
	default:
		mosh_error("Internal error. Unknown link command=%d", link_cmd_args.command);
		ret = -EINVAL;
		break;
	}
	return ret;

show_usage:
	/* Reset getopt for another users: */
	optreset = 1;

	link_shell_print_usage(&link_cmd_args);
	return ret;
}
